/* label of button to dismiss sheet without agreeing (Close rather than OK) */
"Close" = "Zamknij";

/* primary label with product name */
"Connecting to %@..." = "Łączenie z %@...";

/* primary label */
"Connecting..." = "Łączenie...";

/*
 * Primary label displayed when app runs in "about box" mode.
 * Most of the time this is obscured by the sheet displaying the information
 * about the application.
 */
"PrimaryLabelAbout" = "Informacje...";

//----- download progress info -----------------------------------------------//

/* No comment provided by engineer. */
"Downloading (%@ out of %@ Bytes)" = "Pobieranie (%1$@ z %2$@ bajtów)";

/* No comment provided by engineer. */
"Downloading (%@ out of %@ KB)" = "Pobieranie (%1$@ z %2$@ KB)";

/* No comment provided by engineer. */
"Downloading (%@ out of %@ MB)" = "Pobieranie (%1$@ z %2$@ MB)";

//----- product display names ------------------------------------------------//

/** Name displayed in lieu of product when product is not known */
"UnknownTheProduct" = "aplikacja";

/* G2M product display name */
"GoToMeeting" = "GoToMeeting";

/* G2T product display name */
"GoToTraining" = "GoToTraining";

/* G2W product display name */
"GoToWebinar" = "GoToWebinar";

/* G2A product display name */
"GoToAssist" = "GoToAssist";

/* G2AC product display name */
"GoToAssist Corporate" = "GoToAssist Corporate";

/* GoToMyPC product display name */
"GoToMyPC" = "GoToMyPC";


//----- About Box ------------------------------------------------------------//


/* Message (title) displayed on face of about box sheet. */
"AboutBoxMessage" = "GoTo Opener - informacje";

/* Detailed info displayed on face of about box sheet. */
"AboutBoxInfo" = "GoTo Opener ułatwia sprawne działanie witryn oraz oprogramowania GoTo na komputerze.\n\nVersion: %@\n\nLocation: %@";


//----- task labels for main window ------------------------------------------//

/* generic launch progress label */
"Initializing" = "Inicjowanie";

/*
 * Progress label displayed while just-launched, persistently-installed app
 * initially downloads session parameters from Launcher Service
 */
"DownloadingArgs" = "Żądanie określonych informacji o uruchamianiu";

/* progress label displayed while waiting for another DownloaderApp to finish */
"WaitingForMutex" = "Oczekiwanie na zakończenie innego wystąpienia programu GoTo Opener";

/* progress label displayed while DownloaderApp installs itself to persistent location */
"InstallingDlApp" = "Instalowanie programu GoTo Opener";

/* generic starting plugin download progress label */
"Starting Plugin Download" = "Uruchamianie pobierania dodatku";

/* generic installing plugin label */
"Installing Plugin" = "Instalowanie dodatku";

/* generic starting download progress label */
"Starting Download" = "Rozpoczynanie pobierania";

/* generic downloading progress label */
"Downloading" = "Pobieranie";

/* generic verify archive progress label */
"Verifying" = "Weryfikowanie";

/* generic unarchiving progress label */
"Unzipping" = "Rozpakowywanie";

/* generic launch progress label */
"Installing" = "Instalowanie";

/* generic launch progress label */
"Launching" = "Uruchamianie";

/* launch installer progress label */
"Launching Installer" = "Uruchamianie instalatora";

//----- Message text for error alert sheets ----------------------------------//

/* download failed alert message */
"Download Failed" = "Pobieranie nie powiodło się";

/* unarchive failed alert message */
"Unarchive Failed" = "Rozpakowywanie nie powiodło się";

/* installation failed alert message */
"Installation Failed" = "Instalacja nie powiodła się";

/* launch failed alert message */
"Launch Failed" = "Uruchomienie nie powiodło się";

//----- Info text for error alert sheets -------------------------------------//

/* boilerplate introduction for error sheets indicating complete failure of the Launcher to launch app, into which specific product name is inserted */
"AppFatalMsgPre"  = "Niestety program GoTo Opener nie mógł uruchomić %@.";

/* boilerplate introduction for error sheets indicating complete failure of the Launcher to install package, into which specific product name is inserted */
"InstallFatalMsgPre"  = "Niestety program GoTo Opener nie mógł zainstalować %@.";

/* boilerplate conclusion for error sheets indicating complete failure of the Launcher */
"GenericFatalMsgPost" = "Uruchom pobieranie ponownie lub skontaktuj się z globalnym działem obsługi klienta pod adresem\nhttp://link.logmeininc.com/get-help.";

/* boilerplate introduction for error sheets indicating failure of the Launcher to download component due to SSL certificate validation errors. */
"SslCertFatalMsgPre"  = "Niestety program GoTo Opener nie może zaufać serwerowi pobierania.";

/* boilerplate conclusion for error sheets indicating failure of the Launcher to download component due to SSL certificate validation errors. */
"SslCertFatalMsgPost" = "Sprawdź, czy zaktualizowano zaufane certyfikaty w pękach kluczy lub skontaktuj się z globalnym działem obsługi klienta pod adresem \nhttp://link.logmeininc.com/get-help.";

/* notify user that product endpoint version doesn't support OS version */
"ProductSupportForOsErrorInfo" = "Wymagana wersja programu %@ nie obsługuje tej wersji systemu Mac OS X.";

/* app download failed alert informative text */
"DownloadAppFailedErrorInfo" = "Pobranie wymaganej aplikacji z naszych serwerów nie powiodło się.";

/* app download failed alert instructions to manually download and install endpoint */
"DownloadAppFailedOfferManualDownload" = "Aplikacja %@ nie uruchomiła się, ponieważ wystąpił problem z jej pobraniem. Zapisz plik przy użyciu przeglądarki internetowej:\n\n1. Kliknij przycisk Pobierz w przeglądarce.\n2. Otwórz i zainstaluj pobrany plik.\n3. Ponownie spróbuj dołączyć do sesji.";

/* app download failed alert instructions to manually download and install endpoint, post part */
"DownloadAppFailedOfferManualDownloadPost" = "Aby uzyskać dodatkową pomoc, skontaktuj się z administratorem swojego systemu lub pomocą techniczną %@ pod adresem \nhttps://link.logmeininc.com/get-help.";


/* app download failed alert download button */
"Download" = "Pobierz w przeglądarce";

/* installer download failed alert informative text */
"DownloadInstallerFailedErrorInfo" = "Pobranie instalatora z naszych serwerów nie powiodło się.";

/* app unarchive failed alert informative text */
"UnarchiveAppFailedErrorInfo" = "Rozpakowanie wymaganej aplikacji nie powiodło się.";

/* installer unarchive failed alert informative text */
"UnarchiveInstallerFailedErrorInfo" = "Rozpakowanie instalatora nie powiodło się.";

/* failed to place app bundle in permanent location, alert informative text */
"InstallAppFailedErrorInfo" = "Zainstalowanie wymaganej aplikacji nie powiodło się.";

/* app launch failed alert informative text */
"LaunchAppFailedErrorInfo" = "Uruchomienie wymaganej aplikacji nie powiodło się.";

/* installer launch failed alert informative text */
"LaunchInstallerFailedErrorInfo" = "Uruchomienie instalatora nie powiodło się.";

/* app arguments download failed alert informative text */
"DownloadAppArgumentsFailedErrorInfo" = "Pobranie argumentów wymaganej aplikacji z naszych serwerów nie powiodło się.";


//----- for SSL error alert sheets -------------------------------------------//

/* label of button to retry on authentication timeout (not abort the app) */
"AuthTimeoutErrorRetryButtonLabel" = "Spróbuj ponownie";

/* label of button to cancel retry on authentication timeout (so abort the app) */
"AuthTimeoutErrorCancelButtonLabel" = "Zamknij";

/* authentication timeout alert message */
"AuthTimeoutErrorMsg" = "Uwierzytelnianie trwało zbyt długo";

/* authentication timeout alert informative text */
"AuthTimeoutErrorInfo" = "Nie można uwierzytelnić poświadczeń w limicie czasu. Być może podana nazwa lub hasło były nieprawidłowe. Spróbuj ponownie.";

/* label of button to retry on connection lost during authentication (not abort the app) */
"AuthDisconnectErrorRetryButtonLabel" = "Spróbuj ponownie";

/* label of button to cancel retry on connection lost during authentication (so abort the app) */
"AuthDisconnectErrorCancelButtonLabel" = "Zamknij";

/* disconnect during authentication alert message */
"AuthDisconnectErrorMsg" = "Uwierzytelnianie nie powiodło się";

/* disconnect during authentication alert informative text */
"AuthDisconnectErrorInfo" = "Podczas uwierzytelniania nieoczekiwanie utracono połączenie z siecią. Być może podana nazwa lub hasło były nieprawidłowe. Spróbuj ponownie.";

/* SSL server certificate error alert message */
"ServerSslCertErrorMsg" = "Tożsamość serwera niezaufana";

/* generic SSL server certificate error informative text */
"ServerSslCertError" = "Certyfikat serwera wygląda na nieprawidłowy. Połączenie z serwerem może spowodować ryzyko ujawnienia poufnych informacji.";

/* generic SSL server certificate error informative text <URL including host> */
"ServerSslCertErrorWithUrl" = "Certyfikat serwera w \\'%@\\' wygląda na nieprawidłowy. Połączenie z serwerem może spowodować ryzyko ujawnienia poufnych informacji.";

/* generic SSL server certificate error informative text <host name> */
"ServerSslCertErrorWithHostName" = "Certyfikat serwera \\'%@\\' wygląda na nieprawidłowy. Połączenie z serwerem może spowodować ryzyko ujawnienia poufnych informacji.";

/* label of button to close server certificate error dialog and abort the app */
"ServerCertErrorCancelButtonLabel" = "Zamknij";
